; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v3 ?v11)
             (pred_8 ?v12 ?v7)
             (pred_9 ?v3 ?v7)
             (pred_2 ?v5 ?v3 )
	     (pred_1 ?v3)
             (pred_10 ?v8)
             (pred_5 ?v12)
             (pred_12 ?v7)
             (pred_11 ?v3)
             (pred_6 ?v12)
             (pred_7 ?v3)
             (pred_4 ))



(:action op_4
:parameters (?v2 ?v1 ?v4 ?v6)
:precondition (and (pred_10 ?v2) (pred_10 ?v1) (pred_5 ?v4) (pred_12 ?v6)
          (pred_3 ?v2 ?v1) (pred_8 ?v4 ?v6)
                   (pred_9 ?v1 ?v6) (pred_1 ?v2) 
                   (pred_11 ?v1) (pred_6 ?v4))
:effect (and  (pred_7 ?v1) (not (pred_11 ?v1))))


(:action op_2
:parameters (?v2 ?v9)
:precondition (and (pred_10 ?v2) (pred_10 ?v9)
               (pred_1 ?v2) (pred_3 ?v2 ?v9) (pred_7 ?v9))
:effect (and (pred_1 ?v9) (not (pred_1 ?v2))))

(:action op_1
:parameters (?v2 ?v4)
:precondition (and (pred_10 ?v2) (pred_5 ?v4) 
                  (pred_1 ?v2) (pred_2 ?v4 ?v2) (pred_4 ))
:effect (and (pred_6 ?v4)
   (not (pred_2 ?v4 ?v2)) (not (pred_4 ))))


(:action op_3
:parameters (?v2 ?v13 ?v10)
:precondition (and (pred_10 ?v2) (pred_5 ?v13) (pred_5 ?v10)
                  (pred_1 ?v2) (pred_6 ?v10) (pred_2 ?v13 ?v2))
:effect (and (pred_6 ?v13) (pred_2 ?v10 ?v2)
        (not (pred_6 ?v10)) (not (pred_2 ?v13 ?v2))))

(:action op_5
:parameters (?v2 ?v4)
:precondition (and (pred_10 ?v2) (pred_5 ?v4) 
                  (pred_1 ?v2) (pred_6 ?v4))
:effect (and (pred_4 ) (pred_2 ?v4 ?v2) (not (pred_6 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_08 obj_15 obj_14 obj_07 obj_19 obj_29 obj_32 obj_06 obj_16 obj_18 obj_23 obj_24 obj_28 obj_13 obj_09 obj_10 obj_11 obj_17 obj_25 obj_05 obj_21 obj_22 obj_01 obj_20 obj_27
    obj_02 obj_04 obj_03
    obj_31 obj_26 obj_12 obj_30
    )

    (:init
       (pred_4)

       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_29)
       (pred_10 obj_32)
       (pred_10 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_23)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_25)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_22)
       (pred_10 obj_01)
       (pred_10 obj_20)
       (pred_10 obj_27)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_12 obj_03)
       (pred_5 obj_31)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_30)

       (pred_3 obj_08 obj_29)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_15 obj_32)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_29 obj_23)
       (pred_3 obj_29 obj_32)
       (pred_3 obj_29 obj_08)
       (pred_3 obj_32 obj_24)
       (pred_3 obj_32 obj_06)
       (pred_3 obj_32 obj_15)
       (pred_3 obj_32 obj_29)
       (pred_3 obj_06 obj_28)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_06 obj_32)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_23 obj_10)
       (pred_3 obj_23 obj_24)
       (pred_3 obj_23 obj_29)
       (pred_3 obj_24 obj_11)
       (pred_3 obj_24 obj_28)
       (pred_3 obj_24 obj_32)
       (pred_3 obj_24 obj_23)
       (pred_3 obj_28 obj_17)
       (pred_3 obj_28 obj_13)
       (pred_3 obj_28 obj_06)
       (pred_3 obj_28 obj_24)
       (pred_3 obj_13 obj_25)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_28)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_10 obj_21)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_23)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_24)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_25)
       (pred_3 obj_17 obj_28)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_25 obj_20)
       (pred_3 obj_25 obj_05)
       (pred_3 obj_25 obj_13)
       (pred_3 obj_25 obj_17)
       (pred_3 obj_05 obj_27)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_25)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_10)
       (pred_3 obj_22 obj_01)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_22)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_20 obj_25)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_27 obj_05)
       (pred_3 obj_27 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_09)
       (pred_11 obj_28)
       (pred_11 obj_15)
       (pred_9  obj_08 obj_02)
       (pred_9  obj_09 obj_04)
       (pred_9  obj_28 obj_03)
       (pred_9  obj_15 obj_02)
       (pred_7 obj_14)
       (pred_7 obj_07)
       (pred_7 obj_19)
       (pred_7 obj_29)
       (pred_7 obj_32)
       (pred_7 obj_06)
       (pred_7 obj_16)
       (pred_7 obj_18)
       (pred_7 obj_23)
       (pred_7 obj_24)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_11)
       (pred_7 obj_17)
       (pred_7 obj_25)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_22)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_27)

       (pred_8  obj_31 obj_02)
       (pred_8  obj_26 obj_04)
       (pred_8  obj_12 obj_03)
       (pred_8  obj_30 obj_03)
       (pred_2 obj_31 obj_19)
       (pred_2 obj_26 obj_25)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_30 obj_29)
       (pred_1 obj_01)
    )

    (:goal (and
       (pred_2 obj_26 obj_10)
       (pred_2 obj_12 obj_13)
    ))
(:constraints
  (always (not (pred_1 obj_17)))
)
)

; plan
1. (op_2 obj_01 obj_20)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_20)
   goals met: 0 of 2
2. (op_2 obj_20 obj_25)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_25)
   goals met: 0 of 2
3. (op_1 obj_25 obj_26)
   deleted: (pred_2 obj_26 obj_25) (pred_4)
   added: (pred_6 obj_26)
   goals met: 0 of 2
4. (op_2 obj_25 obj_13)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_13)
   goals met: 0 of 2
5. (op_2 obj_13 obj_16)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_16)
   goals met: 0 of 2
6. (op_2 obj_16 obj_06)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_06)
   goals met: 0 of 2
7. (op_3 obj_06 obj_12 obj_26)
   deleted: (pred_6 obj_26) (pred_2 obj_12 obj_06)
   added: (pred_6 obj_12) (pred_2 obj_26 obj_06)
   goals met: 0 of 2
8. (op_2 obj_06 obj_16)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_16)
   goals met: 0 of 2
9. (op_2 obj_16 obj_13)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_13)
   goals met: 0 of 2
10. (op_5 obj_13 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_4) (pred_2 obj_12 obj_13)
   goals met: 1 of 2
11. (op_2 obj_13 obj_16)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_16)
   goals met: 1 of 2
12. (op_2 obj_16 obj_06)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_06)
   goals met: 1 of 2
13. (op_1 obj_06 obj_26)
   deleted: (pred_2 obj_26 obj_06) (pred_4)
   added: (pred_6 obj_26)
   goals met: 1 of 2
14. (op_2 obj_06 obj_32)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_32)
   goals met: 1 of 2
15. (op_2 obj_32 obj_29)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_29)
   goals met: 1 of 2
16. (op_2 obj_29 obj_23)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_23)
   goals met: 1 of 2
17. (op_2 obj_23 obj_10)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_10)
   goals met: 1 of 2
18. (op_5 obj_10 obj_26)
   deleted: (pred_6 obj_26)
   added: (pred_4) (pred_2 obj_26 obj_10)
   goals met: 2 of 2
